---
kind: method
id: M:Autodesk.Revit.DB.SelectionFilterElement.IsEmpty
source: html/343559df-977d-aa0f-d1c8-fdd75f439744.htm
---
# Autodesk.Revit.DB.SelectionFilterElement.IsEmpty Method

Determines whether this filter's set is empty or not.

## Syntax (C#)
```csharp
public bool IsEmpty()
```

## Returns
True if the set is empty, otherwise false.